"""
T28.2 Скласти програму, яка працює в оточенні веб-сервера, для розв’язання задачі.
Знайти у даному рядку символ та довжину найдовшої послідовності однакових символів,
що йдуть підряд. Ввести рядок у браузері. Повернути символ та довжину найдовшої
послідовності символів у форматі:
a) JSON (дана робота)
b) XML
Структуру даних JSON та XML визначити самостійно.
"""

from http.server import HTTPServer, CGIHTTPRequestHandler

HOST = ''
PORT = 8000

print('=== Сервер почав роботу ===')
HTTPServer((HOST, PORT), CGIHTTPRequestHandler).serve_forever()