"""
T28.6 Скласти програму, яка працює в оточенні веб-сервера, для розв’язання задачі. Дано
файл у форматі
a) JSON, (дана робота)
b) XML,
який містить відомості про книги. Відомості про кожну книгу - це прізвище автора, назва
та рік видання. Підібрати усі книги за заданою назвою та/або автором та/або періодом
видання. Вводити відомості про книги треба на окремій сторінці. На іншій сторінці
вводити обмеження та показувати відібрані книги.
"""

from http.server import HTTPServer, CGIHTTPRequestHandler

HOST = ''
PORT = 8000

print('=== Сервер почав роботу ===')
HTTPServer((HOST, PORT), CGIHTTPRequestHandler).serve_forever()